InformationRegisters/ЗадачиОбратныйЗвонокДляАвтозакрытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиОбратныйЗвонокДляАвтозакрытия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Сигнатура непринятого звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗадачиОбратныйЗвонокДляАвтозакрытия/Ext/ManagerModule.bsl
Функция Создать(ИнициаторЗадачи, ДатаПостановки) Экспорт
	Перем Инициатор;
	Инициатор = СокрЛП(ИнициаторЗадачи);
	
	Рез = "ошибка";
	Доступно = Истина;
	Доступно = Доступно И ТипЗнч(Инициатор) 		= Тип("Строка");
	Доступно = Доступно И ТипЗнч(ДатаПостановки)	= Тип("Дата");
	Доступно = Доступно И ЗначениеЗаполнено(Инициатор);
	Доступно = Доступно И ЗначениеЗаполнено(ДатаПостановки);
	Если Не Доступно Тогда
		Возврат Рез+": неверные типы/значения параметров";
	КонецЕсли;
	
	Зап  = РегистрыСведений.ЗадачиОбратныйЗвонокДляАвтозакрытия.СоздатьМенеджерЗаписи();
	Зап.Инициатор = Инициатор;
	Зап.Прочитать();
	Если Зап.Выбран() Тогда
		Возврат Рез+": запись с указанным ключом "+Инициатор+" уже существует";
	КонецЕсли;
	
	Зап.Инициатор 		= Инициатор;
	Зап.ДатаПостановки 	= ДатаПостановки;
	Попытка
		Зап.Записать();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ЗадачиОбратныйЗвонокДляАвтозакрытия.Создать", УровеньЖурналаРегистрации.Ошибка,, "Инициатор = " +Инициатор+"; ДатаПостановки = "+ДатаПостановки, ОписаниеОшибки);
		Возврат Рез+":"+ОписаниеОшибки;
	КонецПопытки;
	Возврат "";
КонецФункции
